In [2]:
import pandas as pd
empdf = pd.read_csv('employees.csv')
empdf.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services

In [21]:
empdf.sum()

Salary     9.066218e+07
Bonus %    1.020755e+04
dtype: float64

In [7]:
empdf['Salary'].sum() #adds all salary rows

90662181

In [8]:
empdf['Bonus %'].sum()

10207.555

In [18]:
#type(empdf['Gender'])
empdf['Start Date'].dtype

dtype('O')

In [14]:
empdf.sum(1) #adds columns because axis = 1

0       97314.945
1       61937.170
2      130601.858
3      138714.340
4      101005.389
5      115173.125
6       65486.012
7       45917.598
8       95588.523
9      139859.524
10      63256.132
11     102520.637
12     112824.492
13     109836.831
14      41440.543
15      59415.256
16      90377.369
17     111743.414
18     132959.082
19      81015.894
20      64718.934
21     100625.645
22      90834.816
23     125797.042
24      97963.873
25      37094.576
26      37605.757
27     122372.218
28     124021.464
29      79536.008
          ...
970     63586.397
971     75428.368
972     76392.159
973    137370.105
974     67672.455
975     92448.467
976    137958.195
977    124571.949
978     66157.178
979    142948.198
980     46241.862
981    149004.280
982     91419.639
983    146918.738
984     43468.040
985     85669.909
986     82888.999
987    136719.331
988     47649.209
989     38347.794
990    100775.982
991    134516.051
992    112780.625
993     56469.040
994     98878.479
995    132499.655
996     42411.675
997     96915.421
998     60511.985
999    129959.169
Length: 1000, dtype: float64

In [15]:
empdf.mean() #Returns the average value

Salary     90662.181000
Bonus %       10.207555
dtype: float64

In [19]:
empdf.std()  #Returns the Bressel standard deviation of the numerical columns.

Salary     32923.693342
Bonus %        5.528481
dtype: float64

In [20]:
empdf.count() #Number of non-null observations

First Name            933
Gender                855
Start Date           1000
Last Login Time      1000
Salary               1000
Bonus %              1000
Senior Management     933
Team                  957
dtype: int64

In [22]:
empdf['Salary'].min()

35013

In [27]:
empdf['Salary'].max()

149908

In [28]:
empdf.max()

Salary     149908.000
Bonus %        19.944
dtype: float64

In [3]:
student_dict = {'name':['sri','ram','hari'], 'age':[23,25,24], 'cgpa':[9.2,8.2,7.2]}
sdf = pd.DataFrame(student_dict)
sdf

   name  age  cgpa
0   sri   23   9.2
1   ram   25   8.2
2  hari   24   7.2

In [30]:
sdf.sum()

name    sriramhari
age             72
cgpa          24.6
dtype: object

In [31]:
sdf.sum(1)

0    32.2
1    33.2
2    31.2
dtype: float64

In [32]:
sdf['age'].min()

23

In [33]:
sdf['cgpa'].max()

9.2

In [34]:
sdf['cgpa'].abs()

0    9.2
1    8.2
2    7.2
Name: cgpa, dtype: float64

In [35]:
sdf['age'].abs()

0    23
1    25
2    24
Name: age, dtype: int64

In [36]:
sdf['age'].mean()

24.0

In [37]:
sdf['age'].median()

24.0

In [38]:
sdf['age'].mode()

0    23
1    24
2    25
dtype: int64

In [39]:
sdf['name'].mode()

0    hari
1     ram
2     sri
dtype: object

In [40]:
sdf['cgpa'].prod() #product of values

543.1679999999999

In [41]:
#std()	Standard Deviation of the Values
# cumsum()	Cumulative Sum
# cumprod()	Cumulative Product

sdf.describe()

        age  cgpa
count   3.0   3.0
mean   24.0   8.2
std     1.0   1.0
min    23.0   7.2
25%    23.5   7.7
50%    24.0   8.2
75%    24.5   8.7
max    25.0   9.2

In [43]:
#describe()
# This function gives the mean, std and IQR values. 
# And, function excludes the character columns and given summary about numeric columns. 
# 'include' is the argument which is used to pass necessary information regarding what columns need to be considered for summarizing. 
# Takes the list of values; by default, 'number'.

# object − Summarizes String columns
# number − Summarizes Numeric columns
# all − Summarizes all columns together (Should not pass it as a list value)
sdf.describe(include = ['object'])

        name
count      3
unique     3
top     hari
freq       1

In [44]:
sdf.describe(include = 'all')

        name   age  cgpa
count      3   3.0   3.0
unique     3   NaN   NaN
top     hari   NaN   NaN
freq       1   NaN   NaN
mean     NaN  24.0   8.2
std      NaN   1.0   1.0
min      NaN  23.0   7.2
25%      NaN  23.5   7.7
50%      NaN  24.0   8.2
75%      NaN  24.5   8.7
max      NaN  25.0   9.2

In [4]:
sdf

   name  age  cgpa
0   sri   23   9.2
1   ram   25   8.2
2  hari   24   7.2